# ---------------------------------------------------------------------------------------------------
# پنل مدیریت ادمین:

# برای ورود به پنل مدیریت باید به مسیر admin/ برویم؛ باید کاربری در جدول auth_user ثبت شده باشد
# از طرفی هر کاربری هم به پنل ادمین دسترسی ندارد، باید یک سری شرایطی باشد، مثلا در جدول auth_user باید
# فیلد های is_super وis_staff و is_active آن  برابر True باشد
# is_staff = True -> به معنی کارمند بودن در سایت هست
# is_active = True -> به معنای فعال بودن حساب کاربری در سایت

# برای ثبت یک super user میبایست به ترمینال رفته و:
# 1. python manage.py createsuperuser -> دستور ساخت یک سوپر یوزر
# 2. Username (leave blank to use 'asus'): mohamadmahdi -> دادن یک یوزرنیم
# 3. Email address: admin@admin.com -> دادن یک ایمیل
# 4. Password: 123456 -> یک پسوردی را تایپ میکنیم
# 5. Password (again): 123456 -> پسورد را دوباره میزنیم
# 6. Bypass password validation and create user anyway? [y/N]: y -> اگه پسورد آسان باشد این پیغام را میدهد
# 7. Superuser created successfully. -> پیغام ساخته شدن سوپر یوزر جدید باموفقیت
# 8. /admin -> حالا میتوان به آدرس ادمین رفته و با یوزرنیم و پسوردی که ساخته ایم وارد پنل ادمین شویم

# بخش های پنل ادمین جنگو:
# Users: برای مدیریت کاربران سایت
# Groups: ما یکسری دسترسی هایی در ادمین داریم و اینجا میتونیم یکسری نقش های کاربری ایجاد کنیم
# که هرکدام به بخش هایی از اپلیکیشن دسترسی دارند، مثلا نقش مدیر منابع انسانی، نقش مدیر محصولات و ...

#کانفیگ اپ های ایجاد شده توسط خودمان در پنل مدیریت:
# ما میتوانیم مدیریت ماژول ها یا اپ هایی که خودمان ایجاد کردیم هم در این پنل داشته باشیم مثل Product
# برای اینکار باید کانفیگ آن را انجام دهیم، فقط کافیه، مدلی که ایجاد کرده ایم رو به ادمین اصلی جنگو
# معرفی کنیم تا برایمان آن را بسازد
# در اپ ما (product_module) فایل admin.py وجود دارد؛ داخل این فایل میتونیم مشخص کنیم که مدل هایی که داخل
# این ماژول هستند، توی ادمین وجود داشته باشند یا خیر؛ پس داخلش models رو import میکنیم و بعدش:
# admin.site.register(models.Product)
# با ایجاد این کد ماژول Product به پنل ادمین اضافه میشود و قابلیت CRUD آن هم وجود دارد

# ---------------------------------------------------------------------------------------------------