# کار با محیط Python Console برای افزودن یک آبجکت در دیتابیس

# برای کار کردن با پروژه هست و برای بیشتر تست و آموزش هست و میتونیم مثلا یک آبجکت جدیدی ایجاد کنیم و کار های دیگر
# ما میتوانیم دستورات خود را داخل این قسمت بنویسیم و با برنامه خود کار کنیم و
# با هر بار دستوری که مینویسیم باید اینتر رو بزنیم تا به لیست سمت راست منتقل شود
# مثلا یک مدلی رو ادد کنیم میاد سمت راست، یا یک آبجکت جدید از مدل ایجاد کنیم دوباره میاد در لیست سمت راست

# مراحل ایمپورت مدل، ساخت آبجکت جدید از آن و ثبت آن در دیتابیس:

# from product_module.models import Product:
# با این دستور سمت راست، مدل Product با مشخصات آن ظاهر میشود

# نکته: این دستورات در پشت پرده تبدیل به دستورات اسکیوالی میشوند تا بتوانند کاری که ما میخواهیم رو در دیتابیس انجام دهند

# ایجاد یک آبجکت جدید از کلاس مدل:
# new_product = Product(title='samsung galaxy s26', price=120000)

# ذخیره آبجکت در دیتابیس:
# اگر کلاسی از Model ارث بری کرده باشه (مثل کلاس Product) عملا میشه جزو جداول دیتابیس ما و اگر نمونه ای
# از آن کلاس ساخته بشه، یک متدی به آن نمونه اضافه میشه تحت عنوان save که میتونیم ازش استفاده کنیم:
# new_product.save()

# Product.objects:
# برای واکشی اطلاعات مورد استفاده قرار میگیرد، یعنی دیتاهای موجود درون جدول Product درون دیتابیس را واکشی میکند

# Product.objects.all() -> ِیک کوئری ست شامل آبجکت های ما را برمیگرداند؛ میتونیم آبجکت های ادد شده رو مشاهده کنیم
# Product.objects.all()[0]  -> مشاهده اولین آبجکت ادد شده
# Product.objects.all()[0].title -> مشاهده فیلد تایتل برای اولین آبجکت ادد شده
# نکته:در استفاده از فانکشن Product.objects.all اگر متد __str__ کلاس مدل رو نوشته باشیم، ، خروجی آن نمایش داده میشود

# نکته: اگر خواستیم داخل محیط ترمینال یا خارج از محیط پایچارم این اعمال را انجام دهیم، میبایست
# اول دستور python manage.py shell رو بنویسیم
# سپس میتونیم دستورات بالا را داخل ترمینال بنویسیم، ولی همان محیط پایتون کنسول بهتر هست و پیشنهاد میشود

# با دستور new_product = None میتونیم متغییر ایجاد شده درون کنسول را خالی از دیتا کنیم

# ----------------------------------------------------------------------------------------------------------------
# لینک دهی برای تگ a بدون استفاده از فانکشن get_absolute_url در فایل models.py:

# <a href="{% url 'product_detail' product_id=product.id %}">
#  {{ product.title }} | Price: {{ product.price }}
# </a>

# ----------------------------------------------------------------------------------------------------------------
