from django.contrib import admin
from . import models


class ProductAdmin(admin.ModelAdmin):
    # readonly_fields = ['slug']
    prepopulated_fields = {
        'slug': ['title']
    }
    list_display = ['__str__', 'price', 'rating', 'is_active']
    list_filter = ['rating', 'is_active']
    list_editable = ['rating', 'is_active']


admin.site.register(models.Product, ProductAdmin)  # معرفی کلاس مدل خود به جنگو ادمین

# ----------------------------------------------------------------------------------------------------------
# class ProductAdmin(admin.ModelAdmin): نحوه نامگذاری براساس قرارداد به این شکل هست

# تنظیماتی که در این کلاس درنظر گرفته میشه، بعنوان تنظیمات Product، در ادمین پروژه درنظر گرفته شود

# readonly_fields = ['slug'] -> درون آن فیلد هایی که میخوایم ریدانلی باشند رو بهش معرفی میکنیم
# فیلد slug رو بعنوان ریدانلی بهش معرفی کردیم، حالا اگر بریم داخل پنل مدیریت، این فیلد فقط خواندنی هست و
# دیگر قابلیت ویرایش آن وجود ندارد، فقط مقدارش را نمایش میدهد

# prepopulated_fields:
# زمانی که میخواهیم فیلدی تحت تاثیر قرار بگیرد، مثلا در اینجا میخواهیم زمانی که title رو در پنل مدیریت تایپ کردیم
# فیلد slug هم تحت تاثیر قرار گرفته و اتوماتیک تولید شود، تا کاربر مشاهده کند چه چیزی قرار هست درون فیلد slug قرار گیرد
# برای آنکه به درستی کار کند نباید فیلد slug رو بصورت readonly تعریف کرده باشیم

# list_display: برای اینکه مشخص کنیم چه فیلد هایی در لیست کلاس مدل ما در پنل ادمین نمایش داده شوند

# list_filter: مشخص میکنیم بر چه اساسی آیتم های لیست فیلتر شوند، که با این کار یک تبی در سمت چپ صفحه باز میشود
# و میتونیم روی لیست نمایش فیلتر اعمال کنیم

# list_editable: برای آنکه بتوانیم در خود صفحه ی نمایش، فیلد هایی را بدون وارد شدن به صفحه آیتم ویرایش کنیم
# فیلد های مورد نظر در قالب یک لیست به آن معرفی میکنیم

# ----------------------------------------------------------------------------------------------------------
