from django.db import models
from django.core.validators import MinValueValidator, MaxValueValidator
from django.urls import reverse
from django.utils.text import slugify


# ایجاد کلاس مدل دسته بندی محصولات:
class ProductCategory(models.Model):
    title = models.CharField(max_length=300, verbose_name="عنوان")
    url_title = models.CharField(max_length=300, verbose_name="عنوان در url")

    def __str__(self):
        return f'( {self.title} - {self.url_title} )'


class Product(models.Model):
    title = models.CharField(max_length=300)
    category = models.ForeignKey(ProductCategory, on_delete=models.CASCADE, null=True, related_name='products')
    price = models.IntegerField()
    rating = models.IntegerField(validators=[MinValueValidator(1), MaxValueValidator(5)], default=0)
    short_description = models.CharField(max_length=360, null=True)
    is_active = models.BooleanField(default=False)
    slug = models.SlugField(default="", null=False, db_index=True, blank=True)

    def __str__(self):
        return f"{self.title} ({self.price})"

    def get_absolute_url(self):
        return reverse('product_detail', args=[self.slug])

    def save(self, *args, **kwargs):
        self.slug = slugify(self.title)
        super().save(*args, **kwargs)

# ----------------------------------------------------------------------------------------------------------------------
# models.py:

# ما میتونیم با ORM که خود جنگو پیاده سازی کرده بدون دانش زبان اسکیوال، با دیتابیس به سادگی کار کنیم
# در اینجا شماهای مربوط به جداول خود در دیتابیس رو ایجاد میکنیم
# دیتابیس داخلی پروژه های جنگو، Sqlite3 است و میتونیم باهاش کار کنیم

# روند ایجاد یک مدل:
# 1. باید یک کلاس برای مدل بسازیم و حتما باید از کلاس Model درون ماژول models ارث بری انجام دهد
# 2. داخل این کلاس فیلد های مدنظر خود را تعریف میکنیم ولی مقدار دهی انجام نمیدهیم، صرفا یک شمای کلی ایجاد میکنیم
# 3. در جنگو نوع فیلد های متفاوتی وجود دارد که کاملش رو میتونیم با سرچ Django Models Fields و در داکیومنت خود جنگو مشاهده کنیم
# CharField => این نوع برای متن های کوتاه مناسب هست، مثل تایتل ها و غیره، در کانستراکتور حداکثر طول رشته رو مشخص میکنیم
# IntegerField => برای فیلدی که نوع عددی صحیح دارد
# DecimalField => برای اعداد اعشاری
# 4. در جنگو، نیازی نیست فیلد کلید اصلی یا همان آیدی رو ایجاد کنیم، این فیلد بصورت اتوماتیک به کلاس اضافه میشود
# چونکه کلاس ما از مدل ارث بری کرده است؛ پس نیازی به افزودن فیلد آیدی نیست، مگر بخواهیم ساختار رو تغییر بدیم که بحث آن جداست

# ----------------------------------------------------------------------------------------------------------------------
# فولدر migrations درون هر اپ یا ماژول های پروژه

# به واسطی که میاد پل یا ارتباطی بین اپلیکیشن و دیتابیس میشود ORM گفته میشوند

# زمان هایی هست میخواهیم ویژگی جدیدی در پروژه ی خود اضافه کنیم؛ در این زمان باید دیتابیس هم از این
# تغییرات آگاه کنیم، مثلا دیتابیس متوجه این بشه که یک فیلد جدیدی ایجاد کردیم یا فیلدی تغییر داده ایم
# یا یک مدل یا جدول جدیدی ایجاد کرده ایم؛ این تغییرات باید به نحوی به دیتابیس منتقل شود
# پس اگر بخواهیم مدلی ایجاد یا تغییر دهیم باید با استفاده از مایگریشن ها تغییراتی که در کد ایجاد
# کرده ایم را به دیتابیس ارسال کنیم؛ با دستور python manage.py میتونیم مجموعه ای از دستورات رو مشاهده کنیم
# دستورات makemigrations و migrate وظیفه ی شناسایی تغییرات و اعمال کردن درون دیتابیس را دارند

# مراحل ایجاد یک مایگریشن جدید:
# 1. python manage.py makemigrations: بررسی کردن خود تغییرات
# وقتی این دستور را در ترمینال نوشتیم، میاد خودش یک فایل پایتون جدید درون فولدر مایگریشنز ایجاد میکنه
# و خودش اتوماتیک مدل یا مدل هایی که در فایل models.py ایجاد کرده ایم رو میسازد
# نکته => اگر قصد تغییری در مدل داریم، هرگز و هرگز نباید به فایل های فولدر مایگریشنز دست بزنیم
# این فایل ها اتوماتیک توسط پایتون ساخته میشوند و براساس تغییراتی هستند که ما در مدل هامون انجام میدهیم
# اگر قصد داشتیم قبل از آپدیت دیتابیس تغییری ایجاد کنیم، باید بریم داخل مدل و آن مدل رو عوض کنیم و سپس
# و باز با دستور makemigrations  یک مایگریشن جدید ایجاد کنیم
# 2. python manage.py migrate: اعمال تغییرات در دیتابیس
# مرحله بعد اینه که تمامی مایگریشن هایی که ایجاد شده اند رو به دیتابیس انتقال داده و تغییراتی که ایجاد شده
# اند رو در دیتابیس هم اعمال کنیم؛ با زدن این دستور، جنگو میره داخل تمامی فولدر های مایگریشنز درون
# تمامی اپ های پروژه و همه ی تغییراتی که اعمال نشده اند یا جدید هستند رو در دیتابیس اعمال میکند
# 3. Database -> Data Source From File/Folder
# اگر در قسمت راست صفحه پایچارم دیتابیس ظاهر نشد میتوانیم به مسیر بالا که گفتیم رفته
# و دیتابیس db.sqlite3 رو ادد کنیم تا در نوار سمت راست برنامه ظاهر شود؛ یا روش دیگه اینه که روی
# خود دیتابیس db.sqlite3 دوبار کلیک کنیم و اونجا ادد رو انجام دهیم
# 4. db -> main -> tables
# در اینجا ما جداول و ساختار دیتابیس پروژه رو مشاهده میکنیم و مدلی هم که ما معرفی کرده بودیم هم
# جدولش را ایجاد کرده که با دوبار کلیک میتونیم وارد جدول شویم و فیلد ها رو مشاهده کنیم
# product_module_porduct -> این اسمیه که برای جدولمون قرار میده، یعنی
# اسم اپ ما را یعنی product_module رو برداشته و سپس مدلی که داخلش ساخته شده یعنی product و اینهارو
# کنار هم قرار داده و اسم جدول رو با این ترکیب کنار هم قرار داده است

# ----------------------------------------------------------------------------------------------------------------------
# def __str__(self):

# این متد رو میتونیم خودمون بازنویسی یا اووراید کنیم و خروجی دلخواهی رو برای آن درنظر بگیریم
# وظیفه این متد معرفی اون نمونه ی ایجاد شده از کلاس هست و میتونیم خودمون خروجی دلخواهی برایش درنظر بگیریم
# و اگر جای دیگری آن نمونه فراخوانی شد، خروجی ای که ما در متد گفته ایم نمایش داده میشود

# ----------------------------------------------------------------------------------------------------------------------
# Validators:

# یکسری فانکشن های معمولی هستند که در صورتی که عملیات معتبر نباشد، یک ارور raise میکند
# اما یکسری Built-in validator هایی هم هستند که میتونیم ازشون استفاده کنیم و در داکیومنت خود سایت جنگو هم کامل وجود دارند
# برای استفاده از آنها باید آنهارا داخل فایلمون ایمپورت کنیم یعنی:
# from django.core.validators import MinValueValidator, MaxValueValidator
# در اینجا گفتیم ولیدیشن های مربوط به ماکزیمم و مینیموم اعداد رو برامون ایمپورت کند
# حالا میتونیم از validator ها برای هر فیلد کلاس مدل خودمون استفاده کنیم؛ که یک لیست هست و در لیست اعتبارسنجی ها را معرفی میکنیم

# ----------------------------------------------------------------------------------------------------------------------
# آپدیت کردن کلاس مدل:

# اگر هر تغییری در مدل ایجاد کنیم باید حتما عملیات مایگریشن رو انجام دهیم
# اگر فیلد جدیدی رو اضافه کرده باشیم و مایگریشن کنیم، اخطار دریافت میکنیم، زیرا که ما رکوردهایی در دیتابیس داریم
# که آن فیلد جدید رو ندارند، به همین دلیل میبایست تصمیم بگیریم که یا یک مقدار پیش فرض برای فیلد درنظر بگیریم یعنی:
# is_active = models.BooleanField(default=False)
# یا روش دوم اینه که مقدار null = True قرار بدیم که در اینصورت
# دیگری نیاز نیست حتما یک مقداری برایش درنظر بگیریم و میتونه این فیلد
# نال باشد و هیچ مقداری درونش وجود نداشته باشد پس:
# is_active = models.BooleanField(null=True)

# ----------------------------------------------------------------------------------------------------------------------
# عملیات CRUD در محیط Python Console

# 1. ایمپورت کردن کلاس مدل:
# from product_module.models import Product

# 2. گرفتن آیتم مورد نظر بوسیله ی شماره ایندکس آن:
# first_product = Product.objects.all()[0]

# 3. گرفتن فیلد مورد نظر با استفاده از نام فیلد:
# first_product.title

# 4. تغییر فیلد مورد نظر:
# first_product.short_description = 'گوشی سامسونگ گلکسی اس 26'
# first_product.is_active = True

# 5. سیو کردن آبجکت به جهت ذخیره در دیتابیس:
# first_product.save()

# حذف یک آیتم از جدول دیتابیس:
# 1.second_product = Product.objects.all()[1] گرفتن آیتم مورد نظر
# 2.second_product.delete()
# و خودش اتوماتیک از دیتابیس حذف میشود

# روش بهتری برای ایجاد یک آیتم جدید در جدول اینه که از مستقیم از متد create استفاده کنیم:
# Product.objects.create(title="samsung galaxy s9", price=20000)

# ----------------------------------------------------------------------------------------------------------------------
# get:

# get(): این دستور فقط یک دیتا را بنابه یک شرایط واکشی میکند مثلا آیتمی رو از جدول بیار که آیدی آن یک عددی باشد
# ما از این دستور زمانی استفاده میکنیم، که مطمئن هستیم از اون آیتم حتما یک دونه وجود دارد وگرنه اگه دوتا باشد ارور میدهد
# Product.objects.get(id=4) واکشی یک آیتم براساس شرط آیدی آن
# Product.objects.get(title="samsung galaxy s26") واکشی یک آیتم براساس شرط عنوان یا اسم آن

# ----------------------------------------------------------------------------------------------------------------------
# filter():

# مثل فانکشن گت هست، ولی این بار چندین آیتم هم میتواند برگرداند و میتونیم فیلتر شده دیتا رو برگردانیم
# اگر آیتمی وجود نداشت، به ما ارور نمیدهد و فقط یک QuerySet خالی برمیگرداند
# Product.objects.filter(is_active=True) فیلتر با یک شرط
# Product.objects.filter(is_active=True, rating=5) فیلتر با دو شرط

# استفاده از فیلتر های آماده در شرط ها:
# https://docs.djangoproject.com/en/6.1/topics/db/queries/ -> داکیومنت همه ی فیلتر ها

# __lt -> lower than | lte -> lower than or equal:
# ما نمیتونیم در شروط عبارتی مثل 4>= رو قرار دهیم، بجای آن جنگو یکسری اسامی خاص رو درنظر گرفته که
# بتونیم ازش استفاده کرده تا دستور ما به درستی تبدیل به دستورات اسکیوال شود
# Product.objects.filter(rating__lt=4) اونهایی که فیلد ریتینگ آنها کمتر از 4 باشد
# Product.objects.filter(rating__lte=4) اونهایی که فیلد ریتینگ آنها مساوی یا کمتر از 4 باشد
# Product.objects.filter(rating__gt=4) اونهایی که فیلد ریتینگ آنها بزرگتر از 4 باشد
# Product.objects.filter(rating__gte=4) اونهایی که فیلد ریتینگ آنها مساوی یا بزرگتر از 4 باشد

# __contains: اون متن یا حروفی که شامل باشد رو برمیگرداند؛ حروف بزرگ و کوچک اهمیت دارد
# Product.objects.filter(title__contains="s20")

# __icontains: مثل کانتینز هست اما حروف بزرگ و کوچک برایش اهمیتی ندارد
# Product.objects.filter(title__contains="Samsung")

# نکته: چون دستوراتی که ما مینویسیم به دستورات دیتابیسی تبدیل میشوند، برخی دیتابیس ها در یکسری موارد
# تفاوت دارند، مثلا در sqlite مهم نیست برایش دستور contains یا icontains رو مشخص کنیم و در نهایت
# برایش حروف کوچک و بزرگ اهمیتی ندارد ولی برای دیتابیسی مثل MySql حروف بزرگ و کوچک اهمیت دارد
# پس باید در انتخاب دستورات خود به نوع دیتابیس هم توجه شود که در نهایت چه خروجی به ما میدهد

# قرار دادن چند شرط بوسیله ی مقدار دهی با پارامتر های بعدی متد فیلتر:
# شرط And رو بررسی میکند، یعنی اینکه هر دو شرط باید حتما برقرار باشند
# Product.objects.filter(is_active=True, rating__gt=3)

# ----------------------------------------------------------------------------------------------------------------------
# Q : میتونیم کوئری های پیشرفته تری رو برای کلاس مدل خود ایجاد کنیم، اول باید فایل مربوطه را ایمپورت کنیم

# form django.db.models import Q

# کوئری میخواهیم ایجاد کنیم که یا is_active=True باشد یا rating آنها بزرگتر از 3 باشد؛ با این سینتکس مینویسیم:
# Product.objects.filter(Q(is_active=True) | Q(rating__gt=3))

# میتونیم ترکیبی از And و Or به این صورت استفاده کنیم؛ یعنی در اینجا، اونهایی رو بیاره که یا is_active=True یا rating > 3
# و علاوه بر آن، اونهایی که rating < 5 باشد:
# Product.objects.filter(Q(is_active=True) | Q(rating__gt=3), rating__lt=5)

# اگر ترکیبی استفاده میکنیم باید حتما قسمت Q اول نوشته شود و سپس در پارامتر های بعدی میتونیم بصورت حالت پیش فرض عادی بنویسیم
# اما میتونیم گزاره عادی هم داخل Q ایجاد کنیم و مشکلی ندارد:
# Product.objects.filter(Q(is_active=True) | Q(rating__gt=3), Q(rating__lt=5))
# الان چون در گزاره عادی از Q استفاده کردیم، میتونیم اولین پارامتر هم آن را بنویسیم:
# Product.objects.filter(Q(rating__lt=5), Q(is_active=True) | Q(rating__gt=3))

# نکته مهم -> در زمانی که ما دستوری را ایجاد میکنیم و داخل یک متغییری میریزیم مثل:
# active_products = Product.objects.filter(is_active=True)
# این دستور فقط ایجاد میشود ولی دیتایی واکشی نمیشود؛ حتی میتوان در سمت راست به آن متغییر رفته و query رو view کنیم
# اما اگر بخواهیم بره سمت دیتابیس و دیتا را واکشی کند باید عملیاتی مثل پرینت و غیره انجام شود مثلا:
# print(active_products)

# ممکن هست ما کوئری رو بارها تغییر بدهیم و بخواهیم که آخر سر سراغ دیتابیس برود و آنرا اعمال کند
# چون که هربار که تغییری ایجاد شود و بخواهد سراغ دیتابیس برود، درست نیست؛ در مثال زیر دوبار کوئری رو
# با فیلتر عوض کرده ایم و آخر سر گفتیم اجرا شود:
# active_products = Product.objects.filter(is_active=True) این کوئری اول
# new_filtered_data = active_products.filter(price__gt=6000000) این کوئری دوم که جدیدتر هست
# در این مرحله، این کوئری هنوز اعمال نشده است؛ لحظه ای اعمال میشه که پرینت بشه؛ یعنی:
# print(new_filtered_data)
# اگر دوبار این دستور پرینت را بزنیم برای دفعه دوم دیتا را از دیتابیس واکشی نمیکند
# بلکه میاد آن دیتای واکشی شده را cache میکند؛ یعنی درون مموری آن را نگه میدارد تا زمانی که نیازش داشته باشیم و کار ما
# با آن تمام شود؛ این یکی از قدرت های فوق العاده فریمورک Django هست
# زمانی هم که کوئری های بالا رو نوشتیم و سپس با پرینت اعمالش کردیم، تمامی اطلاعات فقط در یک کانکشنی که
# به دیتابیس باز میشود، فراخوانی میشوند و چندین کانکشن به دیتابیس باز نمیشود
# برای کنترل منابع، باید تعداد کانکشن هایی که به دیتابیس زده میشوند رو کاهش بدهیم و این موضوع در
# فریمورک Django بصورت اتوماتیک به بی نظیر ترین حالت ممکن پیاده سازی شده است
# البته ما در اینجا کوئری رو درون متغییر ها ریخته ایم، اگر این کار را نکنیم، به ازای هربار اجرای مثلا
# یک فیلتر روی کلاس مدل، داریم عملا به دیتابیس یک کوئری میزنیم، پس زمانی خود جنگو آن را کش میکند
# که ما کوئری که ایجاد کرده ایم رو داخل یک متغییر ذخیره کرده باشیم

# این سیستمی که در Django ORM پیاده سازی شده است، به چه دردی میخورد؟
# مثال واقعی این قضیه زمانی هست که میایم در سایتی انواع فیلتر ها و گزینه های دلخواه خود را وارد
# میکنیم تا جستجوی ما بر اساس آن فیلتر ها انجام شود، مثل سایت دیجی کالا که محصول خود را
# براساس سلیقه و خواسته ی خود براساس گزینه های موجود انتخاب میکنیم و سپس دکمه ی جستجوی محصول را میزنیم
# در اینجا، هر بار که یک فیلتری رو انتخاب میکنیم، سراغ دیتابیس نمیرود، بلکه در آخرین لحظه که روی دکمه
# جستجو کلیک شد، کوئری نهایی براساس فیلتر های ما ساخته میشود و دیتا به یکباره واکشی میشود و نتیجه را مشاهده میکنیم

# ----------------------------------------------------------------------------------------------------------------------
# get_absolute_url():

# ایجاد این متد در کلاس مدل:
# def get_absolute_url(self):
#   return reverse('product_detail', args=[self.id])

# این متد داخل مدل های جنگو هست و ایجادش میکنیم و با استفاده از reverse یک url تولید کرده و از آنطرف در لینک دهی
# تگ a میتونیم بااستفاده از این فانکشن، url را پاس دهیم؛ یعنی href="{{ product.get_absolute_url }}"
# و داخل بدنه ی این فانکشن حتما باید آدرس خود مدل یا محصول را return کنیم
# کاری که دستور reverse انجام میدهد، دقیقا همان کاری هست که دستور url در template هایمان انجام میدادند
# یعنی عملا، اسم ویو رو میگیرد، آرگومان ها را هم میگیرد سپس url را generate میکند و میتونیم ازش استفاده کنیم

# ----------------------------------------------------------------------------------------------------------------------
# SlugField:

# برای بهتر نمایش داده شدن url میتوان برای کلاس های مدل خودمان یک فیلد slug قرار دهیم؛ و بهترین گزینه
# برای استفاده کردن در url همین slug است، مقدار Default آن را روی یک رشته خالی قرار میدهیم، چون نمیخوایم
# خودش اتوماتیک یک مقداری درنظر بگیرد و نمیخوایم داخل دیتابیس در زمانی که پر نشده، اروری بدهد؛
# از طرفی مقدار null را روی False قرار میدهیم، چون حتما باید مقدارش پر شود، حالا برای مدیریت آن باید دستور
# سیو مربوط به کلاس مدل رو override کنیم، در متد سیو، super همان مدل اصلی هست، ما ساختار اصلی متد سیو
# رو دست نمیزنیم، بلکه میایم اون عملیاتی که مدنظر داریم یعنی تنظیم مقدار slug رو انجام میدیم
# کار متد slugify چسباندن کلمات یک متن هست، مثلا ما میخواهیم متن عنوان با - بهم بچسبند
# حال در موقع سیو کردن slug مربوط به هر آیتم درون جدول ساخته میشود
# برای اینکه تازه slug را به مدل اضافه کرده ایم، درون جدول برای آیتم های قبلی فیلد slug خالی هست
# با نوشتن این دستور برای آیتم ها درون محیط پایتون کنسول میتونیم سیو کنیم تا دوباره اسلاگ آنها ساخته شود
# چون ما داخل متد save گفتیم اسلاگ را ایجاد کند، پس درون محیط پایتون کنسول بعد از ایمپورت Product میگیم:
# Product.objects.get(pk=1).save() سیو کردن آیتم اول جدول که کلید اصلی یک دارد
# برای مابقی آیتم ها هم همین کار را میکنیم

# ----------------------------------------------------------------------------------------------------------------------
# db_index = True -> slug = models.SlugField(default="", null=False, db_index=True, blank=True, editable=False)

# ما از این فیلد زیاد استفاده میکنیم، مخصوصا در واکشی اطلاعات زمانی که آنرا میدهیم تا آن آبجکت را پیدا کنیم
# زمانی که ما مقدار db_index را روی True تنظیم میکنیم، نحوه ی واکشی اطلاعات رو جور دیگری درنظر میگیرد، یعنی باعث میشه دیتای ما
# در دیتابیس به نحوی ذخیره شود که کوئری زدن روی آن، سرعت و پرفرمنس بالاتری داشته باشد
# مقدار id هم بصورت اتوماتیک index هست
# هر فیلدی رو نباید index کنیم، زیرا هرچقدر تعداد ایندکس ها بیشتر باشد، میزان پرفرمنس کوئری ما کاهش پیدا میکند
# ترجیحا باید روی فیلد هایی این کار را انجام بدیم که مطمئن هستیم روی اون فیلد، کوئری های زیادی قرار هست انجام شود
# مثلا همین slug field زیاد برای واکشی اطلاعات استفاده میشود به همین دلیل db_index=True قرار داده ایم
# blank = True -> میتونه فیلدش در زمان پر کردن مقادیر کلاس مدل، خالی باشد
# editable = False -> یعنی امکان ویرایش این فیلد وجود نداشته باشد، در پنل ادمین این فیلد حذف میشود

# ----------------------------------------------------------------------------------------------------------------------
# ایجاد رابطه یک به چند بین مدل های Product و ProductCategory:

# باید در یکی از مدل ها فیلدی درنظر بگیریم که ما در Product درنظر میگیریم:
# category = models.ForeignKey(to, on_delete)
# to -> یعنی با کدام جدول متصل شود
# on_delete -> مشخص میکند اگر دسته بندی حذف شود، چه بلایی سر دیتاهایی که در این دسته بندی هستند بیاد
# on_delete = models.CASCADE -> وقتی دسته بندی حذف شود، دیتاهایی هم که داخل آن دسته بندی هستند حذف میشوند
# on_delete = models.SETNULL -> زمانی که دسته بندی حذف شود، مقدار را نال در نظر میگیرد
# on_delete = models.PROTECT -> در صورت حذف دسته بندی، دیتا محافظت میشود و باقی میماند
# متداول ترین حالت حذف CASCADE هست

# ----------------------------------------------------------------------------------------------------------------------
# نحوه ی ایجاد دیتا در محیط Shell در دو جدولی که باهمدیگر ارتباط دارند:

# 1. from product_module.models import Product, ProductCategory
# 2. mobile = ProductCategory(title='موبایل', url_title='mobile')
# 3. mobile.save()
# 4. apple = Product(title='iphone 12', price=20000000, rating=3, short_description='short description',is_active=True, category=mobile)
# 5. apple.save()
# در مرحله 4، اومدیم مستقیم خود mobile که در بالا بعنوان category دادیم به نمونه کلاس مدل، و خودش تشخیص
# میدهد و در جدول میاد category_id آن را ذخیره میکند
# فیلد category همان فیلد مربوط به relation ماست

# بدست آوردن عنوان دسته بندی از طریق فیلد category که فیلد ارتباطی مدل است:
# 1. from product_module.models import Product, ProductCategoryپ
# 2. iphone = Product.objects.all()[0]
# 3. iphone.category.title
# عملا ما از داخل محصول، به دسته بندی که آن محصول دارد، دسترسی داریم و میتونیم فیلد های آن را واکشی کنیم

# ----------------------------------------------------------------------------------------------------------------------
# نحوه ی واکشی اطلاعات در محیط Shell در دو جدولی که با همدیگر رابطه دارند:

# 1. from product_module.models import Product, ProductCategory
# 2. product_by_category = Product.objects.filter(category__url_title='mobile') => محصولاتی رو بیار که در دسته بندی موبایل هستند
# 3. product_by_category   => چاپ کن
# 4. <QuerySet [<Product: iphone 12 (20000000)>]>  => خروجی

# میتوان از دستورات دیگر هم در واکشی اطلاعات استفاده کرد مثلا:
# product_by_category = Product.objects.filter(category__url_title__contains='play') => محصولاتی که دسته بندی آنها شامل کلمه پلی باشند رو بیار

# بدست آوردن Product ها بوسیله ProductCategory:
# mobile = ProductCategory.objects.get(url_title='mobile')  => واکشی دسته بندی که عنوان یوآرال آن موبایل باشد
# mobile  => چاپ کن
# <ProductCategory: موبایل>
# mobile.product_set.all()  => product_set => برای خود جنگو است که اگر متد آل رو بعدش فراخوانی کنیم، محصولاتی که در این دسته بندی هستند رو واکشی میکند
# <QuerySet [<Product: iphone 12 (20000000)>]>  => خروجی

# product_set: اشاره میکند به همان رابطه ای که بین دسته بندی محصولات وجود دارد، این اسمی هست که پیش فرض خود جنگو درنظر گرفته
# ولی میتوان آن را در خود فیلد مربوط به رابطه در قسمت related_name تعویض کرد:
# category = models.ForeignKey(ProductCategory, on_delete=models.CASCADE, null=True, related_name='products')
# البته چون مدل عوض شده باید یک مایگریشن جدید ایجاد کنیم
# حالا میتونیم با اسم جدید به آن دسترسی داشته باشیم:
# from product_module.models import Product, ProductCategory
# mobile = ProductCategory.objects.get(url_title='mobile')
# mobile
# <ProductCategory: موبایل>
# mobile.products.all()
# <QuerySet [<Product: iphone 12 (20000000)>]>

# میتوان بجز فانکشن all فانکشن get و filter یا دیگر فانشکن ها هم اعمال کرد:
# mobile.products.get(title='iphone 12')

# ----------------------------------------------------------------------------------------------------------------------
